[{"id":"1471260833203958","name":"Throwback Thursday","date":"Thu Sep 17 20:00:00 BST 2015","description":"Hi folks!\n\nWelcome to all the new students who've joined us in the past week, and welcome back to our returning members! To start us off this semester we're looking back into the (not too distant) past, to some of the classic games from our childhoods!!\n\n--GAMES--\nGoldenEye64\nTimesplitters 2\nGuitar Hero\nCrash Team Racing\n\nWe look forward to seeing you all there!\nYour GamingSoc committee x"},{"id":"900810030009071","name":"Italian Feast with VegSoc","date":"Sun Sep 20 19:30:00 BST 2015","description":"And we're back to our term time schedule! As the first of a series, we're offering up an Italian feast this Sunday at 7:30pm in the Mansefield (opp the Union).\n\nCome by for great food, great vibes and ok-I-guess people*.\n\nIf you bring food, or help with the cooking the meal is free, otherwise as usual it's £1 for members and £2 for non-members. (meal and years membership is £5)\n\nWe'll be doing our group cooking session from 5pm, and anyone and everyone is welcome as always- whether you would like some basic training in chopping vegetables, or feel the urge to go and create your own experimental italian masterpiece- everyone can get involved!\n\nNOTE: If you are planning to come to this event, please don’t forget to click attend on this event page, so that we know how many of you to expect and how much food to prepare.\n\n*Also who am I kidding the people are awesome."},{"id":"1468299316811501","name":"Gaming Pub Quiz","longitude":-2.7975338,"latitude":56.3416901,"date":"Thu Sep 24 20:00:00 BST 2015","description":"Hi folks!\n\nThanks to everyone who came along to our first event! We're getting our next main event prepared for you in the background, but this week we have our first sub-event of the semester!\n\nCome join us at 8pm in Rascal's Bar (next to the cinema) in the back section, where we'll test your knowledge of all things gaming! Can you remember which game Mario first starred in? Or the name of Cortana's creator? Then come along to our gaming pub quiz, also featuring music and picture rounds for you to enjoy/curse about!\n\nIt's a lot of fun, and we really hope to see you all there!\n\nYour Gamingsoc committee x"},{"id":"745424195584177","name":"STACS Week 2 Pub Meetup","longitude":-2.798655923,"latitude":56.339319588,"date":"Fri Sep 25 20:00:00 BST 2015","description":"Slàinte! \nTGIF\nLet's pub!\nWe will be in one of the best pubs in St Andrews Aikmans(downstairs)!\n\nDear Freshers, please come banter and drink, I need some new friends ;) Meet some awesome new people and talk about tech or not. \n\nSee you soon!\n\n\nOur Society:\n-------------------\nSt. Andrews Computing Society exists to provide a social group for people interested in computing, as well as a support network for people who need technical help or are looking to undertake interesting projects involving computing. We organise events that give us a chance to gain new skills and network with other universities, such as trips to student events around the UK and our yearly hackathon - StacsHack. \n\nIf you know anyone who would be interested in joining, invite them to join this group and be sure to like our page (http://www.facebook.com/StACompSoc) and follow us @StACompSoc on twitter to receive up to the minute news on any new developments and events! If you'd like to join the mailing list, just email stacs@st-andrews.ac.uk"},{"id":"1042666402433771","name":"Tastes of Home: VegSoc 'bring your own' potluck and EGM (existential-crisis general meeting)","date":"Sun Sep 27 19:30:00 BST 2015","description":"(NEWS FLASH: THIS IS OPEN TO EVERYONE, unfortunately facebook will only let us invite people we're already facebook friends with.)\n\nIf you've ever fancied getting more involved in VegSoc- NOW is your chance!\n\nWe will be considering where we want to take VegSoc in the future and in particular how we want to run events this semester. We will also be adding people to our super-amazing committee of gods/goddesses.\n\n------------------------ THE POTLUCK DEETS ------------------------\n\n-The requirement this week for admission is for you to bring any food which you identify with home. It can be a special (vegan(fied) please if possible!) dish which your family make, a national dish, a transnational dish, a sugary thing which makes you happy...\n\nOr, if you're uncomfortable with cooking but want to come you are still welcome- either bring a goody that reminds you of home (please Scottish people don't bring too much iron bru), or drop me a PM or e-mail us vegsoc@st-andrews.ac.uk. and we will team you up with someone for the cooking/sort something else out.\n\nThere will be cooking in the mansefield as always from 5:00.\nEating from 7:30pm.\n\nIn terms of ----------- ADMISSION TO THE COMMITTEE -----------\n\nIt is written into our constitution that we will always find a place for anyone who wants to get more involved with the society in our committee. So the only qualification you will need to get involved in committee fun times is membership (which can also be bought on the night!).\n\nIn terms of the important positions to fill.\nWe will be needing a new:\n\n- Secretary\n- Publicity Officer\n- Website Manager\n- Ticketing officer (role tbc at the meeting)\n\nThese roles can also be split between people which to give you an idea could in part look something like:\n\n- weekly e-mailer\n- Recipe blog maintainer\n- general e-mail organiser\n- coding boss\n\nWe of course always need general helpers (we can think up better names :P) who do the standard vegsoc thang.\n\nThe standard vegsoc thang basic requirements:\n\nTo get on with committeeing, you'll need to be able to:\n\n- Drink Tea and eat food with the rest of the committee on occasion. Generally to enjoy good vibes and spread ethical fun-times. **\n- Cook (at least on occasion, but hopefully weekly) for our events.*\n- Wash-Up with us after events (when the need arises, which is strangely rarely these days...).\n- Put up with sarcastic chat from the rest of the committee.\n\nIf you would like to get involed but can't make it- that's a-ok. Just PM me or e-mail vegsoc@st-andrews.ac.uk with your ideas if you just want to give us your ideas, or get in contact with your intention to join up (and ideas) if you'd like to get more involved with the committee.\n\n------------------------------- Crisis What Crisis? ------------------------------------------\n\nWe'll also be chatting about the future of veg soc, and where we want to go with the society. If you don't want to get into the whole committee shindig, but do want to say something about the society/ideas for our future directions you are very very welcome to just turn up.\n\n--------------------------------      TIMINGS      -----------------------------------\nNew Elections shouldn't last longer than 12 minutes in total (I just made that number up but I feel it's accurate) - Making up new committee position names for people may take longer, but can be done in the background later...\n\nWe'll then get onto VegSoc's existential questions- which will hopefully make up a decent, but not boringly long ammount of our foody chat, followed by a chilled out general chat time afterwards.\n\n----------------------------------------------------------------------------------------------------------\n* You don't already have to be a good cook. I didn't know what I was doing when I joined vegsoc. Genuinely. One of my old profile pictures is me burning pizza in Andrew Melville. All that you need is a tiny-weeny bit of commitment.\n**drinking tea is not an actual requirement."},{"id":"496316733876403","name":"Nintendo Night!","date":"Thu Oct 01 20:00:00 BST 2015","description":"Hi folks,\n\nNow a lot of people say that these days Nintendo is falling behind in the competition, with ridiculous ideas and debatable business strategy. Here at GamingSoc we say... yeah some of that's probably true. But hey, they still make some really great games!! And it's those which we'll be paying homage to this week, with some of the best multiplayer games the big N has to offer!\n\n--GAMES--\nMario Kart 8\nSuper Smash Bros. for Wii U\nNintendo Land\nGoldenEye 007\nSuper Mario Bros. Wii U\n\nWe hope to see you all there!\nYour GamingSoc committee x"},{"id":"507842732727852","name":"VegSoc's low-carbon lunch for Greenweek.","longitude":-2.7879818629199,"latitude":56.336737051372,"date":"Sun Oct 04 12:30:00 BST 2015","description":"We're excited to announce our first collaborative event of the year.\n\nThis week we'll be bringing you a lunch made almost completely from locally sourced produce- and (*drum roll* please) It'll be COMPLETELY FREE, courtesy of Transition University of St Andrews.  \n\nWe'll be at the cosmos as part of Transition's Skillshare event which is kicking off the  St Andrews Green Week 2015. \n\nEating will be from 12:30-2:00pm and we'll have with us as much food as we can source from harvesting this week/weekend. \n\nThere will also be transition members and carbon conversation group leaders on hand to show you how you can get your own locally grown veg for free in St. Andrews, and we'll hopefully be showing off some ideas of what you can do with the produce once you've got it. \n\nFor more information on the other great events on at the skillshare, see:\nhttps://www.facebook.com/SkillShareStAndrews?fref=ts"},{"id":"1051496938203378","name":"Teach Me X Workshop: Web Development with vue.js","longitude":-2.8090126064066,"latitude":56.3401380823,"date":"Wed Oct 07 18:00:00 BST 2015","description":"Are you interested in learning how to write web applications? Do you like pizza? We are kicking off STACS events this year with Teach Me X, a student-led talk/workshop series aiming to explore areas not taught in the CS curriculum. The first talk will run by Michael Lawson, and is about developing modern web applications with vue.js. \n\nThis series would not be possible without our sponsor, JP Morgan, who will be providing food and drinks for this and future events!\n\nFree for STACS members, £3 membership sold on the door. \nIf you are interested in giving a talk, email Nick (nt34@)! \n\nIn Michael's own words:\n----------------------------\n\"In this talk I’m going to be teaching you a little bit about how to make interactive applications for the web using JavaScript. Using a simple front end framework called Vue.js, we’ll (hopefully!) live code a basic todo application which will cover cool ideas like data binding and reactive programming, and show how quickly you can get an idea working but still keep things looking tidy.\"\n\nVue.js: http://vuejs.org\n\nWhat is Teach Me X?\n----------------------------\nTeach Me X is a series of fortnightly evening events where students can teach each other things that are not covered in our CS curriculum. Our main aim is to connect students from different degrees and years of study and empower them to share knowledge on interesting topics, allowing them to pursue personal projects and compete in hackathons using skills and tools that are not normally taught at St Andrews, or expected to be self-learned. The events will be between 1-2 hours long on weekday evenings and drinks and pizza will be provided."},{"id":"1017441608288146","name":"GamingSoc Pocket Edition","longitude":-2.7975338,"latitude":56.3416901,"date":"Thu Oct 08 20:00:00 BST 2015","description":"Hi folks,\n\nThanks to everyone that turned up for Nintendo Night, it was an amazing turnout and it was great to see so many people enjoying themselves!\n\nAnyway, this week we're back at Rascal's Bar for our second sub-event! No quiz this time, just some friendly chat with a few drinks. Come along and discuss how much you're looking forward to Fallout 4, or why Sonic '06 is an underrated masterpiece, or just talk about stuff with some friendly people, then come along and join us!! We're still GamingSoc, there'll be people with handhelds if you want to bring your own!\n\nWe hope to see you all there,\nYour GamingSoc committee xx"},{"id":"511828585650990","name":"Test Event","date":"Sat Oct 10 21:00:00 BST 2015","description":null},{"id":"497660753734513","name":"Iberian, Siberian and Liberian feast with VegSoc","date":"Sun Oct 11 19:30:00 BST 2015","description":"This week we invite you to an Iberian, Siberian and Liberian feast. Come join us at the Mansfield (opposite the Union) at 7:30pm on Sunday for delicious food, great company and chill vibes.\n\nIf you help out with the cooking or bring food with you the meal is free - otherwise it's £1 for members and £2 for non-members, as usual. You can also still get membership, which costs £4.\n\nWe will be cooking at the Mansfield kitchen from 5:30pm. Anyone who wants to join us can PM Nela Soszyńska or Andrew Nall-Cain or just email vegsoc@st-andrews.ac.uk - everyone is welcome to come by and get involved!\n\nNOTE: if you are planning on coming please click \"going\" on the event page so that we can have an idea of how many people to expect and therefore how much food to prepare. Due to an overwhelming crowd showing up for a few past events we are putting a number limit at 80 people, and serving food on a first-come, first-serve basis."},{"id":"146303365722155","name":"Greek and Cypriot Food Fayre","date":"Sat Oct 24 12:00:00 BST 2015","description":"Are you missing home cooked food? Can't wait till Christmas break? Or are you a lover of Greek and Cypriot cuisine? Whatever may be the case, you are welcome to drop in to try some of our most renowned (and delicious) traditional recipes!!!"}]